fn main(){
    println!("　０１２３４５６７８９０１２３４５６７８９０１２３４５６７８９０１２３４５６　");
    println!("５\x1b[48;2;0;60;0m　　　　　　\x1b[0m\x1b[30;47m五\x1b[0m\x1b[48;2;0;60;0m　　　　　　🔻　\x1b[0m\x1b[30;47m🔻\x1b[0m\x1b[48;2;0;60;0m　　　　　　　　　　　　　　　　　　　　　\x1b[0m５");
    println!("６\x1b[48;2;0;60;0m　　　　　　　　　　　\x1b[0m\x1b[30;47m一二\x1b[0m\x1b[30;46m三三\x1b[0m\x1b[30;47m四四四\x1b[0m\x1b[30;47m五\x1b[0m\x1b[30;46m六六六\x1b[0m\x1b[30;47m七\x1b[0m\x1b[30;47m九\x1b[0m\x1b[48;2;0;60;0m　　　　　　　　　　　　　\x1b[0m６");
    println!("　０１２３４５６７８９０１２３４５６７８９０１２３４５６７８９０１２３４５６");    
}